xtra72/STM32H743/WireGuard/lib/st/sx1231.c
#include <stdbool.h>
#include <string.h>
#include "stm32h7xx_hal.h"
#include "sx1231.h"

__weak  void    SX1231_SPI_select(bool select);
__weak  void    SX1231_SPI_transmit(uint8_t* buffer, uint32_t size, uint32_t timeout);
__weak  void    SX1231_SPI_receive(uint8_t* buffer, uint32_t size, uint32_t timeout);

/*******************************************************************
** Global variables                                               **
*******************************************************************/
static   uint8_t RFState = SX1231_RF_STOP;     // RF state machine
static   uint8_t *pRFFrame;             // Pointer to the RF frame
static   uint8_t RFFramePos;            // RF payload current position
static   uint8_t RFFrameSize;           // RF payload size
static  uint16_t ByteCounter = 0;       // RF payload byte counter
static   uint8_t PreMode = SX1231_RF_STANDBY;  // Previous chip operating mode
static   uint8_t SyncSize = 8;          // Size of sync word
static   uint8_t SyncValue[8];          // Value of sync word
static  uint32_t RFFrameTimeOut = SX1231_RF_FRAME_TIMEOUT(1200); // Reception counter value (full frame timeout generation)

static  uint16_t RegistersCfg[] =
{   // SX1231 configuration registers values
	SX1231_DEF_FIFO, // Left for convenience, not to be changed
	SX1231_DEF_OPMODE | SX1231_RF_OPMODE_SEQUENCER_ON | SX1231_RF_OPMODE_LISTEN_OFF | SX1231_RF_OPMODE_STANDBY,
	SX1231_DEF_DATAMODUL | SX1231_RF_DATAMODUL_DATAMODE_PACKET | SX1231_RF_DATAMODUL_MODULATIONTYPE_FSK | SX1231_RF_DATAMODUL_MODULATIONSHAPING_00,
	SX1231_DEF_BITRATEMSB | SX1231_RF_BITRATEMSB_4800,
	SX1231_DEF_BITRATELSB | SX1231_RF_BITRATELSB_4800,
	SX1231_DEF_FDEVMSB | SX1231_RF_FDEVMSB_5000,
	SX1231_DEF_FDEVLSB | SX1231_RF_FDEVLSB_5000,
	SX1231_DEF_FRFMSB | SX1231_RF_FRFMSB_922,
	SX1231_DEF_FRFMID | SX1231_RF_FRFMID_922,
	SX1231_DEF_FRFLSB | SX1231_RF_FRFLSB_922,
	SX1231_DEF_OSC1,
	SX1231_DEF_OSC2,
	SX1231_DEF_LOWBAT | SX1231_RF_LOWBAT_OFF | SX1231_RF_LOWBAT_TRIM_1835,
	SX1231_DEF_LISTEN1 | SX1231_RF_LISTEN1_RESOL_4100 | SX1231_RF_LISTEN1_CRITERIA_RSSI | SX1231_RF_LISTEN1_END_01,
	SX1231_DEF_LISTEN2 | SX1231_RF_LISTEN2_COEFIDLE_VALUE,
	SX1231_DEF_LISTEN3 | SX1231_RF_LISTEN3_COEFRX_VALUE,
	SX1231_DEF_VERSION, 			// Read Only

	SX1231_DEF_PALEVEL | SX1231_RF_PALEVEL_PA0_ON | SX1231_RF_PALEVEL_PA1_OFF | SX1231_RF_PALEVEL_PA2_OFF | SX1231_RF_PALEVEL_OUTPUTPOWER_11111,
	SX1231_DEF_PARAMP | SX1231_RF_PARAMP_40,
	SX1231_DEF_OCP | SX1231_RF_OCP_ON | SX1231_RF_OCP_TRIM_100,

	SX1231_DEF_AGCREF | SX1231_RF_AGCREF_AUTO_ON | SX1231_RF_AGCREF_LEVEL_MINUS80,
	SX1231_DEF_AGCTHRESH1 | SX1231_RF_AGCTHRESH1_SNRMARGIN_101 | SX1231_RF_AGCTHRESH1_STEP1_16,
	SX1231_DEF_AGCTHRESH2 | SX1231_RF_AGCTHRESH2_STEP2_3 | SX1231_RF_AGCTHRESH2_STEP3_11,
	SX1231_DEF_AGCTHRESH3 | SX1231_RF_AGCTHRESH3_STEP4_9 | SX1231_RF_AGCTHRESH3_STEP5_11,
	SX1231_DEF_LNA | SX1231_RF_LNA_ZIN_200 | SX1231_RF_LNA_LOWPOWER_OFF | SX1231_RF_LNA_GAINSELECT_AUTO,
	SX1231_DEF_RXBW | SX1231_RF_RXBW_DCCFREQ_010 | SX1231_RF_RXBW_MANT_24 | SX1231_RF_RXBW_EXP_5,
	SX1231_DEF_AFCBW | SX1231_RF_AFCBW_DCCFREQAFC_100 | SX1231_RF_AFCBW_MANTAFC_20 | SX1231_RF_AFCBW_EXPAFC_3,
	SX1231_DEF_OOKPEAK | SX1231_RF_OOKPEAK_THRESHTYPE_PEAK | SX1231_RF_OOKPEAK_PEAKTHRESHSTEP_000 | SX1231_RF_OOKPEAK_PEAKTHRESHDEC_000,
	SX1231_DEF_OOKAVG | SX1231_RF_OOKAVG_AVERAGETHRESHFILT_10,
	SX1231_DEF_OOKFIX | SX1231_RF_OOKFIX_FIXEDTHRESH_VALUE,
	SX1231_DEF_AFCFEI | SX1231_RF_AFCFEI_AFCAUTOCLEAR_OFF | SX1231_RF_AFCFEI_AFCAUTO_OFF,
	SX1231_DEF_AFCMSB, 			// Read Only
	SX1231_DEF_AFCLSB, 			// Read Only
	SX1231_DEF_FEIMSB, 			// Read Only
	SX1231_DEF_FEILSB, 			// Read Only
	SX1231_DEF_RSSICONFIG | SX1231_RF_RSSI_FASTRX_OFF,
	SX1231_DEF_RSSIVALUE,  		// Read Only

	SX1231_DEF_DIOMAPPING1 | SX1231_RF_DIOMAPPING1_DIO0_00 | SX1231_RF_DIOMAPPING1_DIO1_00 | SX1231_RF_DIOMAPPING1_DIO2_00 | SX1231_RF_DIOMAPPING1_DIO3_00,
	SX1231_DEF_DIOMAPPING2 | SX1231_RF_DIOMAPPING2_DIO4_00 | SX1231_RF_DIOMAPPING2_DIO5_01 | SX1231_RF_DIOMAPPING2_CLKOUT_OFF,
	SX1231_DEF_IRQFLAGS1,
	SX1231_DEF_IRQFLAGS2,
	SX1231_DEF_RSSITHRESH | 228,	// Must be set to (-Sensitivity x 2)
	SX1231_DEF_RXTIMEOUT1 | SX1231_RF_RXTIMEOUT1_RXSTART_VALUE,
	SX1231_DEF_RXTIMEOUT2 | SX1231_RF_RXTIMEOUT2_RSSITHRESH_VALUE,

	SX1231_DEF_PREAMBLEMSB | SX1231_RF_PREAMBLESIZE_MSB_VALUE,
	SX1231_DEF_PREAMBLELSB | SX1231_RF_PREAMBLESIZE_LSB_VALUE,
	SX1231_DEF_SYNCCONFIG | SX1231_RF_SYNC_ON | SX1231_RF_SYNC_FIFOFILL_AUTO | SX1231_RF_SYNC_SIZE_4 | SX1231_RF_SYNC_TOL_0,
	SX1231_DEF_SYNCVALUE1 | 0x69,
	SX1231_DEF_SYNCVALUE2 | 0x81,
	SX1231_DEF_SYNCVALUE3 | 0x7E,
	SX1231_DEF_SYNCVALUE4 | 0x96,
	SX1231_DEF_SYNCVALUE5 | SX1231_RF_SYNC_BYTE5_VALUE,
	SX1231_DEF_SYNCVALUE6 | SX1231_RF_SYNC_BYTE6_VALUE,
	SX1231_DEF_SYNCVALUE7 | SX1231_RF_SYNC_BYTE7_VALUE,
	SX1231_DEF_SYNCVALUE8 | SX1231_RF_SYNC_BYTE8_VALUE,
	SX1231_DEF_PACKETCONFIG1 | SX1231_RF_PACKET1_FORMAT_VARIABLE | SX1231_RF_PACKET1_DCFREE_OFF | SX1231_RF_PACKET1_CRC_ON | SX1231_RF_PACKET1_CRCAUTOCLEAR_ON | SX1231_RF_PACKET1_ADRSFILTERING_OFF,
	SX1231_DEF_PAYLOADLENGTH | 255,
	SX1231_DEF_NODEADRS | SX1231_RF_NODEADDRESS_VALUE,
	SX1231_DEF_BROADCASTADRS | SX1231_RF_BROADCASTADDRESS_VALUE,
	SX1231_DEF_AUTOMODES | SX1231_RF_AUTOMODES_ENTER_OFF | SX1231_RF_AUTOMODES_EXIT_OFF | SX1231_RF_AUTOMODES_INTERMEDIATE_SLEEP,
	SX1231_DEF_FIFOTHRESH | SX1231_RF_FIFOTHRESH_TXSTART_FIFONOTEMPTY | SX1231_RF_FIFOTHRESH_VALUE,
	SX1231_DEF_PACKETCONFIG2 | SX1231_RF_PACKET2_RXRESTARTDELAY_1BIT | SX1231_RF_PACKET2_AUTORXRESTART_ON | SX1231_RF_PACKET2_AES_OFF,
	SX1231_DEF_AESKEY1 | SX1231_RF_AESKEY1_VALUE,
	SX1231_DEF_AESKEY2 | SX1231_RF_AESKEY2_VALUE,
	SX1231_DEF_AESKEY3 | SX1231_RF_AESKEY3_VALUE,
	SX1231_DEF_AESKEY4 | SX1231_RF_AESKEY4_VALUE,
	SX1231_DEF_AESKEY5 | SX1231_RF_AESKEY5_VALUE,
	SX1231_DEF_AESKEY6 | SX1231_RF_AESKEY6_VALUE,
	SX1231_DEF_AESKEY7 | SX1231_RF_AESKEY7_VALUE,
	SX1231_DEF_AESKEY8 | SX1231_RF_AESKEY8_VALUE,
	SX1231_DEF_AESKEY9 | SX1231_RF_AESKEY9_VALUE,
	SX1231_DEF_AESKEY10 | SX1231_RF_AESKEY10_VALUE,
	SX1231_DEF_AESKEY11 | SX1231_RF_AESKEY11_VALUE,
	SX1231_DEF_AESKEY12 | SX1231_RF_AESKEY12_VALUE,
	SX1231_DEF_AESKEY13 | SX1231_RF_AESKEY13_VALUE,
	SX1231_DEF_AESKEY14 | SX1231_RF_AESKEY14_VALUE,
	SX1231_DEF_AESKEY15 | SX1231_RF_AESKEY15_VALUE,
	SX1231_DEF_AESKEY16 | SX1231_RF_AESKEY16_VALUE,

