xtra72/STM32H743/WireGuard/lib/st/sx1231.c
	SX1231_DEF_TEMP1 | SX1231_RF_TEMP1_ADCLOWPOWER_ON,
	SX1231_DEF_TEMP2
};

/*******************************************************************
** Configuration functions                                        **
*******************************************************************/

void    SX1231_init(void)
{
}

/*******************************************************************
** InitRFChip : This routine initializes the RFChip registers     **
**              Using Pre Initialized variables                   **
********************************************************************
** In  : -                                                        **
** Out : -                                                        **
*******************************************************************/
void SX1231_initRFChip (void)
{
    uint16_t i;

    /////// RC CALIBRATION (Once at POR) ///////
    SX1231_setRFMode(SX1231_RF_STANDBY);
    SX1231_writeRegister(0x57, 0x80);
    SX1231_writeRegister(SX1231_REG_OSC1, SX1231_readRegister(SX1231_REG_OSC1) | SX1231_RF_OSC1_RCCAL_START);
    while ((SX1231_readRegister(SX1231_REG_OSC1) & SX1231_RF_OSC1_RCCAL_DONE) == 0x00);
    SX1231_writeRegister(SX1231_REG_OSC1, SX1231_readRegister(SX1231_REG_OSC1) | SX1231_RF_OSC1_RCCAL_START);
    while ((SX1231_readRegister(SX1231_REG_OSC1) & SX1231_RF_OSC1_RCCAL_DONE) == 0x00);
    SX1231_writeRegister(0x57, 0x00);
    ////////////////////////////////////////////

    for(i = 1; i <= SX1231_REG_TEMP2; i++)
    {
        SX1231_writeRegister(i, RegistersCfg[i]);
    }

    SyncSize = ((RegistersCfg[SX1231_REG_SYNCCONFIG] >> 3) & 0x07) + 1;
    for(i = 0; i < SyncSize; i++)
    {
        SyncValue[i] = RegistersCfg[SX1231_REG_SYNCVALUE1 + i];
    }

    RFFrameTimeOut = SX1231_RF_FRAME_TIMEOUT(1200); // Worst case bitrate

    SX1231_setRFMode(SX1231_RF_SLEEP);
}

/*******************************************************************
** SX1231_setRFMode : Sets the SX1231 operating mode                     **
********************************************************************
** In  : mode                                                     **
** Out : -                                                        **
*******************************************************************/
void SX1231_setRFMode(uint8_t mode)
{
    if(mode != PreMode)
    {
        if(mode == SX1231_RF_TRANSMITTER)
        {
            SX1231_writeRegister(SX1231_REG_OPMODE, (RegistersCfg[SX1231_REG_OPMODE] & 0xE3) | SX1231_RF_TRANSMITTER);
            while ((SX1231_readRegister(SX1231_REG_IRQFLAGS1) & SX1231_RF_IRQFLAGS1_MODEREADY) == 0x00); // Wait for ModeReady
            PreMode = SX1231_RF_TRANSMITTER;
        }

        else if(mode == SX1231_RF_RECEIVER)
        {
            SX1231_writeRegister(SX1231_REG_OPMODE, (RegistersCfg[SX1231_REG_OPMODE] & 0xE3) | SX1231_RF_RECEIVER);
            while ((SX1231_readRegister(SX1231_REG_IRQFLAGS1) & SX1231_RF_IRQFLAGS1_MODEREADY) == 0x00); // Wait for ModeReady
            PreMode = SX1231_RF_RECEIVER;
        }

        else if(mode == SX1231_RF_SYNTHESIZER)
        {
            SX1231_writeRegister(SX1231_REG_OPMODE, (RegistersCfg[SX1231_REG_OPMODE] & 0xE3) | SX1231_RF_SYNTHESIZER);
            while ((SX1231_readRegister(SX1231_REG_IRQFLAGS1) & SX1231_RF_IRQFLAGS1_MODEREADY) == 0x00); // Wait for ModeReady
            PreMode = SX1231_RF_SYNTHESIZER;
        }

        else if(mode == SX1231_RF_STANDBY)
        {
            SX1231_writeRegister(SX1231_REG_OPMODE, (RegistersCfg[SX1231_REG_OPMODE] & 0xE3) | SX1231_RF_STANDBY);
            while ((SX1231_readRegister(SX1231_REG_IRQFLAGS1) & SX1231_RF_IRQFLAGS1_MODEREADY) == 0x00); // Wait for ModeReady
            PreMode = SX1231_RF_STANDBY;
        }

        else
        {// mode == SX1231_RF_SLEEP
            SX1231_writeRegister(SX1231_REG_OPMODE, (RegistersCfg[SX1231_REG_OPMODE] & 0xE3) | SX1231_RF_SLEEP);
            while ((SX1231_readRegister(SX1231_REG_IRQFLAGS1) & SX1231_RF_IRQFLAGS1_MODEREADY) == 0x00); // Wait for ModeReady
            PreMode = SX1231_RF_SLEEP;
        }
    }
}

/*******************************************************************
** SX1231_writeRegister : Writes the register value at the given address **
**                  on the SX1231                                 **
********************************************************************
** In  : address, value                                           **
** Out : -                                                        **
*******************************************************************/
void SX1231_writeRegister(uint8_t address, uint16_t value)
{
    uint8_t buffer[2];

    buffer[0] = 0x80 | address;
    buffer[1] = value;

    SX1231_SPI_select(true);

    SX1231_SPI_transmit(buffer, 2, 10);
    SX1231_SPI_select(false);
}

/*******************************************************************
** SX1231_readRegister : Reads the register value at the given address on**
**                the SX1231                                      **
********************************************************************
** In  : address                                                  **
** Out : value                                                    **
*******************************************************************/
uint16_t SX1231_readRegister(uint8_t address)
{
    uint8_t buffer;

    SX1231_SPI_select(true);

    SX1231_SPI_transmit(&address, 1, 10);
    SX1231_SPI_receive(&buffer, 1, 10);

    SX1231_SPI_select(false);

    return buffer;
}


/*******************************************************************
** Communication functions                                        **
*******************************************************************/

/*******************************************************************
** SendRfFrame : Sends a RF frame                                 **
********************************************************************
** In  : *buffer, size                                            **
** Out : *pReturnCode                                             **
*******************************************************************/
void SX1231_sendRfFrame(uint8_t *buffer, uint8_t size, uint8_t *pReturnCode)
{
    if((size+1) > SX1231_RF_BUFFER_SIZE_MAX)
    {
        RFState |= SX1231_RF_STOP;
        *pReturnCode = ERROR;
        return;
    }

    RFState |= SX1231_RF_BUSY;
    RFState &= ~SX1231_RF_STOP;
    RFFrameSize = size;
    pRFFrame = buffer;

    SX1231_writeRegister(SX1231_REG_DIOMAPPING1, (RegistersCfg[SX1231_REG_DIOMAPPING1] & 0x3F) | SX1231_RF_DIOMAPPING1_DIO0_00); // DIO0 is "Packet Sent"
    SX1231_writeRegister(SX1231_REG_FIFOTHRESH, (RegistersCfg[SX1231_REG_FIFOTHRESH] & 0x7F) | SX1231_RF_FIFOTHRESH_TXSTART_FIFONOTEMPTY);

    SX1231_setRFMode(SX1231_RF_SLEEP);

