xtra72/STM32H743/WireGuard/lib/st/sx1231.c
    SX1231_sendByte(RFFrameSize);
    for(ByteCounter = 0, RFFramePos = 0; ByteCounter < RFFrameSize;)
    {
        SX1231_sendByte(pRFFrame[RFFramePos++]);
        ByteCounter++;
    }

    SX1231_setRFMode(SX1231_RF_TRANSMITTER); //   => Tx starts since FIFO is not empty

    //    do{
    //    }while(!(RegPAIn & DIO0)); // Wait for Packet sent

    SX1231_setRFMode(SX1231_RF_SLEEP);


    RFState |= SX1231_RF_STOP;
    RFState &= ~SX1231_RF_TX_DONE;
    *pReturnCode = OK;
} // void SendRfFrame(uint8_t *buffer, uint8_t size, uint8_t *pReturnCode)

/*******************************************************************
** ReceiveRfFrame : Receives a RF frame                           **
********************************************************************
** In  : -                                                        **
** Out : *buffer, size, *pReturnCode                              **
*******************************************************************/
void SX1231_receiveRfFrame(uint8_t *buffer, uint8_t *size, uint8_t *pReturnCode)
{

    uint8_t TempRFState;

    *pReturnCode = RX_RUNNING;

    TempRFState = RFState;

    if(TempRFState & SX1231_RF_STOP)
    {
        pRFFrame = buffer;
        RFFramePos = 0;
        RFFrameSize = 2;

        SX1231_writeRegister(SX1231_REG_DIOMAPPING1, (RegistersCfg[SX1231_REG_DIOMAPPING1] & 0x3F) | SX1231_RF_DIOMAPPING1_DIO0_01); // DIO0 is "PAYLOADREADY"
    	SX1231_writeRegister(SX1231_REG_SYNCCONFIG, (RegistersCfg[SX1231_REG_SYNCCONFIG] & 0xBF) | SX1231_RF_SYNC_FIFOFILL_AUTO);

        //        RegIrqEnLow |= 0x04; // Enables Port A pin 2 interrupt DIO0 (PAYLOADREADY)

        SX1231_setRFMode(SX1231_RF_RECEIVER);
        SX1231_enableTimeOut(true);
        RFState |= SX1231_RF_BUSY;
        RFState &= ~SX1231_RF_STOP;
        RFState &= ~SX1231_RF_TIMEOUT;
        return;
    }
    else if(TempRFState & SX1231_RF_RX_DONE)
    {

        SX1231_setRFMode(SX1231_RF_SLEEP);
        RFFrameSize = SX1231_receiveByte();
        for(ByteCounter = 0, RFFramePos = 0; ByteCounter < RFFrameSize; ){
            pRFFrame[RFFramePos++] = SX1231_receiveByte();
            ByteCounter++;
        }

        *size = RFFrameSize;
        *pReturnCode = OK;
        RFState |= SX1231_RF_STOP;
        SX1231_enableTimeOut(false);
        RFState &= ~SX1231_RF_RX_DONE;
        //        RegIrqEnLow &= ~0x04; // Disables Port A pin 2 interrupt DIO0 (PAYLOADREADY)
        //        SPINss(1);
        return;
    }
    else if(TempRFState & SX1231_RF_ERROR)
    {

        SX1231_setRFMode(SX1231_RF_SLEEP);

        RFState |= SX1231_RF_STOP;
        RFState &= ~SX1231_RF_ERROR;
        *pReturnCode = ERROR;
        //        RegIrqEnLow &= ~0x04; // Disables Port A pin 2 interrupt DIO0 (PAYLOADREADY)
        //        SPINss(1);
        return;
    }
    else if(TempRFState & SX1231_RF_TIMEOUT)
    {

        SX1231_setRFMode(SX1231_RF_SLEEP);

        RFState |= SX1231_RF_STOP;
        RFState &= ~SX1231_RF_TIMEOUT;
        SX1231_enableTimeOut(false);
        *pReturnCode = RX_TIMEOUT;
        //        RegIrqEnLow &= ~0x04; // Disables Port A pin 2 interrupt DIO0 (PAYLOADREADY)
        //        SPINss(1);
        return;
    }
} // void ReceiveRfFrame(uint8_t *buffer, uint8_t size, uint8_t *pReturnCode)

/*******************************************************************
** SX1231_sendByte : Sends a data to the transceiver through the SPI     **
**            interface                                           **
********************************************************************
** In  : b                                                        **
** Out : -                                                        **
*******************************************************************/
void SX1231_sendByte(uint8_t b)
{
	SX1231_writeRegister(SX1231_REG_FIFO, b); // SPI burst mode not used in this implementation
} // void SX1231_sendByte(uint8_t b)

/*******************************************************************
** SX1231_receiveByte : Receives a data from the transceiver through the **
**               SPI interface                                    **
********************************************************************
** In  : -                                                        **
** Out : b                                                        **
*******************************************************************/
uint8_t SX1231_receiveByte(void)
{
	return SX1231_readRegister(SX1231_REG_FIFO); //SPI burst mode not used in this implementation
}
/*******************************************************************
** Transceiver specific functions                                 **
*******************************************************************/

/*******************************************************************
** ReadRssi : Reads the Rssi value from the SX1231                **
********************************************************************
** In  : -                                                        **
** Out : value                                                    **
*******************************************************************/
uint16_t SX1231_ReadRssi(void)
{ // Must be called while in RX
	uint16_t value;
	SX1231_writeRegister(SX1231_REG_RSSICONFIG, RegistersCfg[SX1231_REG_RSSICONFIG] | SX1231_RF_RSSI_START); // Triggers RSSI measurement
	while ((SX1231_readRegister(SX1231_REG_RSSICONFIG) & SX1231_RF_RSSI_DONE) == 0x00);               // Waits for RSSI measurement to be completed
	value = SX1231_readRegister(SX1231_REG_RSSIVALUE);                                         // Reads the RSSI result
	return value;
}

/*******************************************************************
** ReadFei : Triggers FEI measurement and returns its value       **
********************************************************************
** In  : -                                                        **
** Out : value                                                    **
*******************************************************************/
int16_t SX1231_ReadFei(void)
{ // Must be called while in RX
	int16_t value;
	SX1231_writeRegister(SX1231_REG_AFCFEI, RegistersCfg[SX1231_REG_AFCFEI] | SX1231_RF_AFCFEI_FEI_START);   // Triggers FEI measurement
	while ((SX1231_readRegister(SX1231_REG_AFCFEI) & SX1231_RF_AFCFEI_FEI_DONE) == 0x00);             // Waits for FEI measurement to be completed
	value = ((SX1231_readRegister(SX1231_REG_FEIMSB) << 8) | SX1231_readRegister(SX1231_REG_FEILSB));        // Reads the FEI result
	return value;
}

/*******************************************************************
** AutoFreqControl : Calibrates the receiver frequency to the     **
**               transmitter frequency                            **
********************************************************************
** In  : -                                                        **
** Out : *pReturnCode                                             **
*******************************************************************/
void SX1231_AutoFreqControl(uint8_t *pReturnCode)
{ // Must be called while in RX
	SX1231_writeRegister(SX1231_REG_AFCFEI, RegistersCfg[SX1231_REG_AFCFEI] | SX1231_RF_AFCFEI_AFC_START);   // Triggers AFC measurement
	while ((SX1231_readRegister(SX1231_REG_AFCFEI) & SX1231_RF_AFCFEI_AFC_DONE) == 0x00);             // Waits for AFC measurement to be completed
    *pReturnCode = OK;
}

/*******************************************************************
** Utility functions                                              **
*******************************************************************/

/*******************************************************************
** Wait : This routine uses the counter A&B to create a delay     **
**        using the RC ck source                                  **
********************************************************************
** In   : cntVal                                                  **
** Out  : -                                                       **
*******************************************************************/
void SX1231_wait(uint16_t cntVal)
{
    for(int i = 0 ; i < cntVal ; i++)
    {
    }
}

/*******************************************************************
** SX1231_enableTimeOut : Enables/Disables the software RF frame timeout **
********************************************************************
** In  : enable                                                   **
** Out : -                                                        **
*******************************************************************/
void SX1231_enableTimeOut(uint8_t enable)
{
} // void SX1231_enableTimeOut(uint8_t enable)

/*******************************************************************
** Handle_Irq_Pa1 : Handles the interruption from the Pin 1 of    **
**                  Port A                                        **
********************************************************************
** In  : -                                                        **
** Out : -                                                        **
*******************************************************************/
void SX1231_Handle_Irq_Pa1 (void)
{ // DIO1 (Not used in this implementation)

