xtra72/STM32H743/WireGuard/lib/st/sx1231.c
} //End Handle_Irq_Pa1

/*******************************************************************
** Handle_Irq_Pa2 : Handles the interruption from the Pin 2 of    **
**                  Port A                                        **
********************************************************************
** In  : -                                                        **
** Out : -                                                        **
*******************************************************************/
void SX1231_Handle_Irq_Pa2 (void)
{ // DIO0 = PAYLOADREADY in RX

    RFState |= SX1231_RF_RX_DONE;
    RFState &= ~SX1231_RF_BUSY;

} //End Handle_Irq_Pa2

/*******************************************************************
** Handle_Irq_CntA : Handles the interruption from the Counter A  **
********************************************************************
** In              : -                                            **
** Out             : -                                            **
*******************************************************************/
void SX1231_Handle_Irq_CntA (void)
{
    RFState |= SX1231_RF_TIMEOUT;
    RFState &= ~SX1231_RF_BUSY;
} //End Handle_Irq_CntA


/*******************************************************************
** SX1231_transmit :                                                 **
********************************************************************
** In              : -                                            **
** Out             : -                                            **
*******************************************************************/
__weak  void SX1231_SPI_transmit(uint8_t* buffer, uint32_t size, uint32_t timeout)
{
}

/*******************************************************************
** SX1231_receive :                                                 **
********************************************************************
** In              : -                                            **
** Out             : -                                            **
*******************************************************************/
__weak  void SX1231_SPI_receive(uint8_t* buffer, uint32_t size, uint32_t timeout)
{
}

/*******************************************************************
** SX1231_select :                                                 **
********************************************************************
** In              : -                                            **
** Out             : -                                            **
*******************************************************************/
__weak  void SX1231_SPI_select(bool select)
{
}

